"use client";

const OfferPage = () => {
   return (
      <div>
         <h1 className="legal-title">ПУБЛИЧНАЯ ОФЕРТА</h1>

         <div className="legal">
            <p>Публичная оферта FARM-BASKET</p>
            <p>
               Текст настоящего договора-оферты расположен в сети Интернет на
               web-сайте Исполнителя <a href="https://farmbasket.by"></a>{" "}
               FARM-BASKET.by.
            </p>
            <p>
               Настоящий договор (далее по тексту — «договор-оферта» или
               «Договор») представляет собой официальное предложение ИП Лещёва
               З.М., (далее — Исполнитель) заключить договор на рекламную
               деятельность в интересах Заказчика с любым юридическим лицом или
               физическим лицом (далее — Заказчик), на нижеследующих условиях:
            </p>
            <h2>1. ПРЕДМЕТ ДОГОВОРА</h2>
            <p>
               1.1. Заказчик поручает Исполнителю, а Исполнитель принимает на
               себя обязательства:
            </p>
            <ul>
               <li>
                  (а) за вознаграждение совершать за счёт Заказчика сделки,
                  связанные с реализацией товаров Заказчика через Платформу, в
                  т.ч. предоставлять возможность размещать предложения товаров
                  на Платформе, передавать информацию о заказах товаров
                  Заказчика, оказывать информационное обслуживание Клиентов;
               </li>
               <li>(б) оказывать рекламные услуги Заказчику;</li>
               <li>
                  (в) оказывать Заказчику услуги в соответствии с Разделами и
                  Приложениями к Договору;
               </li>
               <li>(г) оказывать иные услуги в соответствии с Договором.</li>
            </ul>
            <p>
               1.2. Для настоящего Договора Стороны договорились применять
               следующие определения:
            </p>

            <p>
               {" "}
               Маркетплейс – информационная система (программа для электронных
               вычислительных машин), платформа электронной коммерции,
               размещенная на ссылка, функционал которой позволяет Доверителям
               размещать Товары с целью реализации, в том числе в рамках
               Договора между Доверителем и Farm-Basket.{" "}
            </p>
            <p>
               Регистрация в МП — заведение личного кабинета Продавца,
               добавление брендов по необходимости, согласование условий и
               доведение до подписания контракта Продавца с МП, интеграция
               учетных систем Продавца с системами МП по API, загрузка
               ассортимента, добавление контента для товаров, прохождение
               модерации товаров Продавца.
            </p>
            <p>
               Создание контента — это подготовка карточек для бренда и товаров
               в МП, создание текстовых описаний, указание/корректировка цены и
               загрузка графических и фото изображений, а также по необходимости
               подготовка отзывов и официальных ответов на вопросы покупателей,
               создание предметных, имиджевых фото, инфографики, видео, фото 360
               и другого контента, необходимого для успешного продвижения бренда
               и роста продаж товаров Продавца в МП.
            </p>
            <p>
               Продвижение — комплекс мер, направленных на повышение
               узнаваемости бренда, отработку обратной связи от покупателей,
               анализ продаж и конкурентов, подготовку рекомендаций по товару,
               ассортименту и отгрузкам, улучшение сбыта в МП и в сети Интернет,
               другие действия с целью привлечения заинтересованной целевой
               аудитории и побуждению к совершению покупки.
            </p>

            <h2>2. СРОКИ ИСПОЛНЕНИЯ ОБЯЗАТЕЛЬСТВ</h2>
            <p>
               2.1. Датой начала работ считается день, следующий за днем
               подтверждения Исполнителем получения Заявки на оказание
               бесплатных услуг по регистрации и продвижению в маркетплейсе
               FARM-BASKET (Приложение №1 к данному договору-оферте).
               Подтверждение осуществляется любым из следующих способов: письмо,
               отправленное на адрес электронной почты, указанный в заявке, чат
               в мессенджере Viber, либо Telegram, в который включен абонент с
               номером телефона, указанном в качестве контактного в Заявке.
               Датой окончания работ является последний день двенадцатимесячного
               срока, отсчитываемого со дня первой продажи на FARM-BASKET.
            </p>
            <p>
               2.2.1. По окончании каждого месяца работ Исполнитель направляет в
               адрес Заказчика отчет, содержащий перечень выполненных работ, а
               также план работ на следующий месяц.
            </p>

            <h2>3. ЦЕНА ДОГОВОРА И ПОРЯДОК ОПЛАТЫ</h2>
            <p>
               3.1. Стоимость рекламных услуг в МП компании/бренда/товаров
               Заказчика с момента заключения настоящего Договора составляет 70
               рублей за регистрацию и продвижение.
            </p>
            <h2>4. ОБЯЗАТЕЛЬСТВА СТОРОН</h2>
            <p>4.1. Исполнитель обязуется:</p>
            <ul>
               <li>
                  4.1.1. Выполнять работы в соответствии с правилами
                  маркетплейса, предоставлять Заказчику отчеты о проделанных
                  работах по окончанию каждого месяца.
               </li>
               <li>
                  4.1.2. Исполнитель имеет право по согласованию с Заказчиком
                  привлекать третьи лица для выполнения условий настоящего
                  Договора. В этом случае Исполнитель несет ответственность за
                  их действия как за свои собственные.
               </li>
               <li>
                  4.1.3. Предоставлять Заказчику информацию по Созданию контента
                  для МП: написанию текстовых материалов, предполагаемое
                  название, содержание, фото- и текстовые описания карточек
                  товаров, а также рекомендации и/или требования к написанию.
               </li>
               <li>
                  4.1.4. По согласованию с Заказчиком или по рекомендации
                  Заказчика вносить изменения, связанные c контентом на МП, в
                  том числе корректировка цен, информация по акциям, связанные с
                  правкой описания карточек товаров с целью улучшения
                  привлекательности и демонстрации потребительских свойств,
                  удобства поиска и покупки в МП.
               </li>
            </ul>
            <p>4.2. Заказчик обязуется:</p>
            <ul>
               <li>
                  4.2.1. Своевременно обеспечивать Исполнителя достоверной
                  информацией о Компании, бренде, потребительских свойствах,
                  составе и другой информацией, необходимой для подготовки
                  описания карточек продукта, текущими ценами и ожидаемыми
                  изменениями цен, наличием остатков на складах и ожидаемыми
                  изменениями в производстве (незамедлительно сообщить в случае
                  вывода товара из производства) с целью внесения Исполнителем в
                  МП актуальной информации по продуктам, формирования заявок на
                  поставку, своевременной обработки обратной связи от
                  покупателей.
               </li>
               <li>
                  4.2.2. Предоставить полный доступ к Личному кабинету Продавца
                  в МП для выполнения работ по Настоящему договору.
               </li>
               <li>
                  4.2.3. Заказчик обязуется исполнить поставку товаров в МП по
                  заранее согласованной с Исполнителем и МП заявке на поставку
                  оговоренных объемов в оговоренные сроки.
               </li>
               <li>
                  4.2.4. В течение 5 (Пяти) рабочих дней рассмотреть и проверить
                  все текстовые материалы, подготовленные Исполнителем для
                  размещения в МП. Внести корректировки или предложить
                  собственный текст по теме при необходимости.
               </li>
               <li>
                  4.2.5. В течение всего срока действия настоящего Договора
                  заранее уведомлять Исполнителя о действиях, влияющих на
                  регистрацию и продвижение в МП Заказчика, таких, как:
                  изменение ответственных за взаимодействие с Исполнителем лиц,
                  сотрудничество с другими Исполнителями по работе в МП,
                  регистрация, размещение товаров и проведение рекламных
                  кампаний (в том числе изменение цен) в других маркетплейсах.
               </li>
               <li>
                  4.2.6. По запросу Маркетплейса подтвердить, что Исполнитель
                  является официальным представителем Заказчика на основании
                  Настоящего договора в течение срока его действия.
               </li>
               <li>
                  4.2.7. Заказчик разрешает на сайте Исполнителя разместить
                  информацию о проекте, содержащую: краткое описание задачи
                  проекта; описание проекта; список людей, работавших по
                  настоящему Договору.
               </li>
               <li>
                  4.2.8. Нести ответственность за достоверность предоставляемой
                  Исполнителю информации.
               </li>
            </ul>
            <h2>5. КОНФИДЕНЦИАЛЬНОСТЬ</h2>
            <p>
               5.1. Стороны признают, что в ходе исполнения настоящего Договора
               они будут иметь доступ к информации, которая является
               собственностью другой Стороны и необходима для выполнения
               обязательств по Договору.
            </p>
            <p>
               5.2. В течение срока действия настоящего Договора, а также 5
               (Пяти) лет после окончания срока его действия, Стороны обязуются
               соблюдать условия конфиденциальности информации, представляющей
               коммерческий или иной интерес для Сторон.
            </p>
            <h2>6. ДЕЙСТВИЕ НЕПРЕОДОЛИМОЙ СИЛЫ (ФОРС-МАЖОР)</h2>
            <p>
               6.1 Стороны освобождаются от ответственности за частичное или
               полное неисполнение обязательств по настоящему Договору, если это
               неисполнение явилось следствием обстоятельств непреодолимой силы,
               возникших после заключения настоящего Договора в результате
               событий чрезвычайного характера, которые Стороны не могли ни
               предвидеть, ни предотвратить разумными мерами.
            </p>
            <p>
               6.2. О наступлении обстоятельств, указанных в п. 6.1. настоящего
               Договора, Стороны обязуются уведомлять друг друга незамедлительно
               с приложением документального подтверждения.
            </p>
            <h2>7. ПОРЯДОК РАЗРЕШЕНИЯ СПОРОВ</h2>
            <p>
               7.1. Стороны несут ответственность за неисполнение, либо
               ненадлежащее исполнение принятых на себя по настоящему Договору
               обязательств в соответствии с законодательством Республики
               Беларусь.
            </p>
            <p>
               7.2. Все споры и разногласия между сторонами должны решаться
               путем переговоров. В случае, если Стороны не придут к соглашению,
               то спор подлежит рассмотрению в Арбитражном суде Республики
               Беларусь.
            </p>
            <h2>
               8. СРОК ДЕЙСТВИЯ ДОГОВОРА, ОСНОВАНИЯ И ПОРЯДОК ЕГО ПРЕКРАЩЕНИЯ
            </h2>
            <p>
               8.1. Каждая из Сторон имеет право на досрочное расторжение
               настоящего Договора с предварительным письменным уведомлением
               другой Стороны не менее чем за 10 (десять) календарных дней.{" "}
            </p>
            <p>
               8.2. Настоящий Договор может быть продлен по окончании срока
               действия при обоюдном согласии Сторон, оформленном письменно в
               виде Соглашения, являющегося неотъемлемой частью настоящего
               Договора. 8.3. Настоящий Договор вступает в силу с даты его
               подписания и действует в течение всего срока исполнения
               обязательств, указанного в п. 2.1 настоящего Договора.
            </p>
            <h2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
            <p>
               9.1. Приложения к настоящему Договору являются его неотъемлемой
               частью.
            </p>
            <p>
               9.2. Все изменения и дополнения к настоящему Договору, становятся
               его неотъемлемой частью и действительны в письменной форме с
               подписями обеих Сторон.
            </p>
            <p>
               9.3. Стороны согласились с тем, что Дополнения к данному
               Договору, заключенные посредством факсимильной и/или электронной
               связи, имеют юридическую силу при условии последующего обмена
               оригиналами.
            </p>
            <p>
               9.4. Стороны договорились с тем, что факсимильная или электронная
               копии акта выполненных работ, подписанная обеими сторонами,
               является документом с юридической силой.
            </p>
            <h2>
               10. ЮРИДИЧЕСКИЙ АДРЕС И ПЛАТЕЖНЫЕ РЕКВИЗИТЫ ИСПОЛНИТЕЛЯ ИП ЛЕЩЁВА
               З.М.
            </h2>
            <div className="requisites">
               <p>
                  Платежные реквизиты: ИП Лещёва Злата Максимовна
                  <br />
                  УНП 291887836
                  <br />
                  BY65PJCB30136064381000000933
                  <br />
                  ‘ПРИОРБАНК’ ОАО, БИК PJCBBY2X
                  <br />
                  Телефон: +375 33 3729057
                  <br />
                  E-mail: farm.basket.shop@gmail.com
                  <br />
                  Сайт: <a href="https://farmbasket.by">FARM-BASKET.by</a>
               </p>
            </div>
         </div>
      </div>
   );
};

export default OfferPage;
