"use client";

const OfferPage = () => {
   return (
      <div>
         <h1 className="legal-title">ПУБЛИЧНАЯ ОФЕРТА</h1>

         <div className="legal">
            <p>
               В настоящей публичной оферте (далее по тексту - Оферта) термины и
               определения, указанные в настоящем разделе, используются в
               указанном ниже значении, если не оговорено иное.
            </p>
            <p>
               Сайт — веб-сайт ссылка, предоставляющий Покупателям сведения о
               Товарах, условиях их оплаты и доставки, необходимые для
               совершения покупки и позволяющий Покупателям приобретать Товары
               на условиях Оферты.
            </p>
            <p>Владелец Сайта — ИП Лещёва З.М. </p>
            <p>
               Покупатель — физическое лицо, имеющее намерение заказать или
               приобрести Товар исключительно для личных, семейных, домашних и
               иных нужд, не связанных с осуществлением предпринимательской
               деятельности и разместившее Заказ на сайте, либо указанное в
               Заказе в качестве получателя Товара.
            </p>
            <p>
               Продавец — индивидуальный предприниматель или юридическое лицо,
               осуществляющие деятельность по продаже Товара и предлагающие
               заключить договор купли-продажи Товара, используя Сайт.{" "}
            </p>
            <p>
               Товар — объект купли-продажи (вещь), не изъятый и не ограниченный
               в гражданском обороте и представленный к продаже на сайте,
               посредством размещения в соответствующем разделе. Предметом
               купли-продажи могут быть продовольственные и непродовольственные
               Товары, отмеченные на сайте как Товары со статусом «в наличии».
               Изображения продуктов, указанные на сайте, могут отличаться от
               изображений в действительности.
            </p>
            <p>
               Заказ — оформленный запрос Покупателя на покупку и доставку по
               указанному в запросе адресу Товаров, выбранных на сайте,
               отправленный посредством сети Интернет.
            </p>
            <p>
               Личный кабинет — страница сайта, созданная в результате
               регистрации Покупателя и связанная с учетной записью Покупателя
               на сайте, при использовании которой Покупателю доступно
               взаимодействие с Продавцом на предложенных Продавцом условиях.
            </p>

            <h2>2. Общие положения</h2>
            <ul className="list-none">
               <li>
                  2.1. Настоящая Публичная оферта регулирует взаимоотношения
                  Продавца и Покупателя, а также определяет порядок розничной
                  купли-продажи Товаров через Сайт.
               </li>
               <li>
                  2.2. К отношениям между Покупателем и Продавцом применяются
                  положения закон РБ от 9 января 2002 г. № 90-З «О защите прав
                  потребителей» и иные нормативные правовые акты.
               </li>
               <li>
                  2.3. Владелец Сайта устанавливает требования к качеству
                  Товаров, предлагаемых к продаже на Сайте и следит за их
                  соблюдением.
               </li>
               <li>
                  2.4. Заказывая Товары через Сайт, Покупатель соглашается с
                  условиями продажи и доставки Товаров, содержащимися в Оферте,
                  и принимает их в полном объеме.
                  <p className="ml-2">
                     Акцептом (принятием условий) Оферты является любое из
                     следующих действий: <br />
                     Регистрация на Сайте; <br />
                     Авторизация на Сайте.
                  </p>
                  <p className="ml-2">
                     Оформление заказа осуществляется путем нажатия на кнопку «В
                     корзину» в личном кабинете Покупателя на Сайте, путем
                     обращения без авторизации на Сайте по телефонам, указанным
                     на Сайте, или любым другим способом, позволяющим Продавцу
                     и/или Владельцу Сайта идентифицировать Покупателя.
                  </p>
               </li>
               <li>
                  2.5. Условия Оферты являются одинаковыми для всех Покупателей.
                  Владелец Сайта вправе в одностороннем порядке без уведомления
                  Продавца и/или Покупателя внести изменения в Оферту. Такие
                  изменения вступают в силу с момента опубликования новой
                  редакции Оферты на Сайте. <br />
                  Условия Оферты распространяются на все Товары, представленные
                  на Сайте. Предложение о продаже Товаров действует в течение
                  срока размещения на Сайте информации о наличии Товаров в
                  продаже.
                  <p className="ml-2">
                     Сообщая Продавцу и Владельцу Сайта свой e-mail и номер
                     телефона, Покупатель дает согласие на их использование
                     Владельцем Сайта, а также третьими лицами, привлекаемыми
                     Владельцем Сайта, в следующих целях:
                     <br />- выполнения обязательств по договорам купли-продажи
                     с Покупателями;
                     <br />- осуществления рассылок рекламного и информационного
                     характера, содержащих информацию о скидках, предстоящих и
                     действующих акциях и других мероприятиях Продавца и/или
                     Владельца Сайта, о передаче заказа в доставку, а также иную
                     информацию, непосредственно связанную с выполнением
                     обязательств в рамках Оферты.
                  </p>
               </li>

               <li>
                  2.7. Продавец и его представители вправе связаться с
                  Покупателем по предоставленному номеру телефона для уточнения
                  деталей Заказа.
               </li>
            </ul>

            <h2>3. Регистрация на Сайте</h2>
            <ul>
               <li>
                  3.1. Регистрация на Сайте осуществляется с помощью раздела
                  «Регистрация» и последующего заполнения этой формы.
               </li>
               <li>
                  3.2. Владелец Сайта не несет ответственности за точность и
                  правильность информации, предоставляемой Пользователем при
                  регистрации.
               </li>
               <li>
                  3.3. Покупатель обязуется не сообщать третьим лицам логин и
                  пароль, указанные им при регистрации. В случае, если у
                  Покупателя возникнут подозрения относительно безопасности его
                  логина и пароля или возможности их несанкционированного
                  использования третьими лицами, Покупатель обязуется
                  незамедлительно уведомить об этом Владельца Сайта, направив
                  соответствующее электронное письмо по адресу:
                  farm.basket.shop@gmail.com
               </li>
            </ul>
            <h2>4. Оформление заказа</h2>

            <ul>
               <li>
                  4.1. Владелец Сайта размещает на Сайте описание Товаров, в
                  т.ч. сведения о наличии сертификатов качества и иных
                  документов, подтверждающих соответствие Товаров обязательным
                  требованиям, если таковые установлены законодательством.
                  <br />
                  Описание товара как правило сопровождается фотографиями.
                  Фотографии Товаров являются простыми иллюстрациями: Товары
                  могут отличаться от изображения на фотографии.
               </li>
               <li>
                  4.2. В связи с техническими особенностями формирования базы
                  данных Сайта и особенностями производства, заказанные
                  Покупателем Товары могут отсутствовать в наличии у Продавца.
                  <br />В таком случае Продавец или Владелец сайта вправе
                  исключить отсутствующий Товар из Заказа (аннулировать Заказ,
                  если отсутствуют все заказанные Покупателем товары) или с
                  согласия Покупателя заменить товар на аналогичный товар
                  другого производителя (информация о таком Товаре содержится на
                  Сайте), уведомив об этом Покупателя путем направления
                  соответствующего электронного сообщения по адресу, указанному
                  Покупателем при регистрации или звонком/sms сообщением по
                  указанному Покупателем номеру телефона.
                  <br />В случае, если Продавцу или его представителям не
                  удалось связаться с Покупателем по предоставленному им номеру
                  телефона до момента окончания сборки Заказа, дальнейшая
                  корректировка Заказа не производится, а Товары, которых нет в
                  наличии, удаляются.
                  <br />
                  Если Товаров в Заказе нет в наличии и Продавцу или его
                  представителям не удалось связаться с Покупателем по
                  предоставленному им номеру телефона, Заказ аннулируется.
                  <br />В случае аннулирования полностью оплаченного Заказа,
                  стоимость оплаченных Товаров возвращается Продавцом Покупателю
                  способом, которым Товар был оплачен.
               </li>
               <li>
                  4.3. Оформление Заказа происходит в разделах Сайта путем
                  нажатия кнопки «В корзину», а затем нажатия кнопки
                  «Подтвердить» в разделе «Моя корзина». После завершения
                  процесса оформления Заказа, Заказу автоматически присваивается
                  идентификационный номер («№ заказа»).
               </li>
               <li>
                  4.4. Минимальная сумма заказа устанавливается Владельцем
                  Сайта. Информация о минимальной сумме заказа отображается в
                  разделе «Моя корзина». Продавец не осуществляет бесплатную
                  доставку при заказе на сумму ниже минимальной.
               </li>
               <li>
                  4.5. Покупатель указывает адрес доставки и контактные данные,
                  необходимые для передачи Заказа Покупателю или уполномоченному
                  им лицу. <br />
                  Исполнение Продавцом и Владельцем Сайта своих обязательств
                  перед Покупателем зависит от правильности указания Покупателем
                  сведений о себе, необходимых для доставки Заказа. Продавец и
                  его представители не несут ответственность за невозможность
                  исполнения своих обязательств перед Покупателем, вызванных
                  предоставлением Покупателем неполной информации.
               </li>
               <li>
                  4.6. После оформления Заказа Покупателю предоставляется
                  информация о предполагаемой дате доставки путем направления
                  электронного сообщения по адресу, указанному Покупателем при
                  регистрации, или по телефону. Менеджер, отвечающий за
                  выполнение Заказа Покупателя, при необходимости может уточнить
                  детали Заказа, согласовать дату доставки, наличие заказанных
                  Товаров на складе Продавца и времени, необходимого для
                  обработки и доставки Заказа. Информация о дате передачи Заказа
                  для доставки Покупателю сообщается Покупателю по электронной
                  почте, в Личном кабинете на Сайте, путем направления
                  смс-сообщения либо по телефону. <br />
                  Дата передачи Товара устанавливается Владельцем Сайта с учетом
                  оптимальной логистической схемы перевозок, учитывающей
                  дорожную ситуацию в городе, а также с учетом необходимости
                  обеспечивать оптимальный температурный режим при перевозке. С
                  учетом данных обстоятельств, Владелец Сайта вправе уточнить
                  дату и время доставки Товара, согласовав их с Покупателем.
                  <br />
                  Дата передачи Товара может быть изменена Владельцем Сайта или
                  Продавцом м в одностороннем порядке при наличии независящих от
                  них непредвиденных обстоятельств, не позволяющих своевременно
                  доставить Товар.
               </li>
            </ul>
            <p>5. Доставка заказа</p>
            <ul>
               <li>
                  5.1. Территория доставки Товаров, представленных на Сайте и
                  реализуемых Владельцем Сайта, ограничена пределами города
                  Гродно.
               </li>
               <li>
                  5.2. Задержки в доставке возможны ввиду непредвиденных
                  обстоятельств, произошедших не по вине Продавца или Владельца
                  Сайта, таких как: непредвиденные помехи движению транспорта;
                  ограничение проезда по улицам, вызванное авариями,
                  внеплановыми дорожными работами, дорожно-транспортными
                  происшествиями; действия властей; аномальные природные
                  явления, создающие риск повреждения транспорта, помещений либо
                  риск жизни людей. <br />
                  Действие указанных обстоятельств продляет срок доставки заказа
                  сообразно их продолжительности. В случае, если непредвиденные
                  обстоятельства продлятся более 1 календарного дня, Покупатель
                  вправе отказаться от исполнения договора.
               </li>
               <li>
                  5.3. При доставке Заказ вручается Покупателю либо третьему
                  лицу, указанному в Заказе в качестве получателя в разделе
                  «Имя» (далее Покупатель и третье лицо именуются «Получатель»).
                  При невозможности получения Заказа, оплаченного посредством
                  наличного расчета, указанными выше лицами, Заказ может быть
                  вручен лицу, который может предоставить сведения о Заказе
                  (номер отправления и/или ФИО Получателя), а также оплатить
                  стоимость Заказа в полном объеме лицу, осуществляющему
                  доставку Заказа.
               </li>
               <li>
                  5.4. Во избежание случаев мошенничества, а также в целях
                  выполнения договора, при вручении предоплаченного Заказа лицо,
                  осуществляющее доставку Заказа, вправе потребовать документ,
                  удостоверяющий личность Получателя, а также указать сведения о
                  таком документе (наименование, номер, дату выдачи) на
                  квитанции к Заказу.
               </li>
               <li>
                  5.5. Владелец Сайта гарантирует конфиденциальность и защиту
                  персональных данных Получателя.
               </li>
               <li>
                  5.6. Риск случайной гибели или случайного повреждения Товара
                  переходит к Покупателю с момента передачи ему Заказа и
                  проставления Получателем Заказа подписи в документах,
                  подтверждающих доставку Заказа. В случае недоставки Заказа
                  Владелец Сайта возмещает Покупателю стоимость предоплаченного
                  Покупателем Заказа и доставки в полном объеме после получения
                  от Службы доставки подтверждения утраты Заказа.
               </li>
               <li>
                  5.7. Стоимость доставки каждого Заказа рассчитывается
                  индивидуально, исходя из сведений о Продавце заказанного
                  Товара, веса Товара, региона и способа доставки, а также (в
                  случае необходимости) формы оплаты. Сформированная стоимость
                  доставки Заказа указывается на последнем этапе оформления
                  Заказа на Сайте. Покупатель понимает и соглашается с тем, что
                  доставка Товара является платной услугой при несоблюдении
                  заказа на минимальную сумму. <br />
                  Доставка Товара осуществляется силами Владельца Сайта либо
                  третьими лицами (транспортными организациями, курьерскими
                  службами).
                  <br />
                  Уточнить дату, время и при необходимости маршрут доставки,
                  можно по контактному номеру, указанному на странице
                  «Контакты».
               </li>
               <li>
                  5.8. Обязанность Владельца Сайта передать товар Покупателю
                  считается исполненной в момент вручения курьером Товара
                  Получателю в месте, указанном Покупателем при оформлении
                  Заказа в графе «Адрес доставки».
               </li>
               <li>
                  5.9. Принятие Товара Покупателем:
                  <p className="ml-2">
                     Покупатель обязан осмотреть доставленный Товар при
                     получении Заказа в присутствии курьера Владельца Сайта, для
                     проверки количества, ассортимента и комплектности Товара,
                     срока годности доставленного Товара и целостности упаковки.
                  </p>
                  <p className="ml-2">
                     Если доставленный Товар соответствует Заказу, Покупатель
                     должен его принять и оплатить (если не оплатил ранее),
                     поставить роспись в «Бланке доставки заказов» либо ином
                     аналогичном документе, предоставляемом курьером.
                  </p>
                  <p className="ml-2">
                     После приемки Товара Покупателем и/или Получателем Владелец
                     Сайта не принимает претензий по количеству и внешнему виду
                     Товара.
                  </p>
                  <p className="ml-2">
                     Время нахождения курьеров, доставляющих Товар, реализуемый
                     Продавцом, по адресу Покупателя ограничено 15 минутами.
                  </p>
               </li>
            </ul>
            <h2>6. Оплата товара</h2>

            <ul>
               <li>
                  6.1. Цена Товара указывается на Сайте в рублях Республики
                  Беларусь.
               </li>
               <li>
                  6.2. Цена Товара устанавливается Продавцом и/или Владельцем
                  Сайта и является условием Оферты. Цена Товара может быть
                  изменена Продавцом и/или Владельцем Сайта в одностороннем
                  порядке. При этом цена на заказанный Покупателем Товар
                  изменению не подлежит.
               </li>
               <ul className="ml-2">
                  6.3. Товар может быть оплачен Покупателем следующим способом:
                  <li>
                     6.3.1. Путем оплаты банковской картой при получении Заказа;
                  </li>
                  <li>
                     6.3.2. Путем оплаты онлайн в Личном кабинете при оформлении
                     заказа ;
                  </li>
                  <li>
                     6.3.3. Посредством использования механизма рекуррентных
                     платежей онлайн (автоплатежей).
                  </li>
               </ul>
               <li>
                  6.4. Оплата банковскими картами Заказов на Сайте
                  осуществляется посредством использования механизма
                  рекуррентных платежей (автоплатежей) в порядке,
                  предусмотренном настоящим пунктом.{" "}
                  <p className="ml-2">
                     Для оплаты Заказа посредством использования механизма
                     рекуррентных платежей (автоплатежей) Покупатель
                     самостоятельно указывает данную форму оплаты Товара при
                     оформлении Заказа.
                  </p>
                  <p className="ml-2">
                     При осуществлении первого Заказа Покупатель вводит
                     реквизиты банковской карты. По окончании оформления Заказа
                     с указанной Покупателем банковской карты автоматически
                     списываются денежные средства в размере фактической
                     стоимости Заказа.
                  </p>
                  <p className="ml-2">
                     При последующих оплатах Заказов Покупателя с банковской
                     карты будет сразу произведен платеж в размере фактической
                     стоимости заказа без повторной верификации банковской
                     карты.
                  </p>
                  <p className="ml-2">
                     Фактическая (окончательная) стоимость Заказа определяется
                     после сборки Заказа Продавцом и зависит от веса конкретного
                     Товара.
                  </p>
                  <p className="ml-2">
                     При неудачной попытке списать фактическая стоимость Заказа,
                     форма оплаты автоматически устанавливается способом,
                     указанным в подпункте 6.3.1. Оферты.
                  </p>
                  <p className="ml-2">
                     Указанием на форму оплаты Заказа, указанную в настоящем
                     пункте, Покупатель выражает свое согласие на осуществление
                     всех последующих сделок по приобретению Товара аналогичным
                     способом безакцептно. Отказаться от безакцептной оплаты
                     Покупатель может в любой момент, используя Личный кабинет.
                  </p>
               </li>
               <li>
                  6.5. Продавец и/или Владелец Сайта вправе предоставлять скидки
                  на Товары и устанавливать программу бонусов. Виды скидок,
                  бонусов, порядок и условия начисления определяются Продавцом
                  и/или Владельцем Сайта самостоятельно и указываются на Сайте.
                  Бонусы и скидки могут быть изменены Продавцом в одностороннем
                  порядке. Срок действия акций, скидок, бонусов устанавливается
                  Продавцом и доводится до Покупателя на Сайте.
               </li>
               <li>
                  6.6. Заказ считается не укомплектованным, если Покупатель
                  сообщил об изменении решения о покупке до момента начала
                  сборки заказа Продавцом. В таком случае Продавец не приступает
                  к сборке заказа. <br />
                  Если Покупатель сообщил Продавцу об отказе от Заказа после
                  момента начала сборки заказа Продавцом, то такой Заказ
                  считается отклоненным. В таком случае Продавец вправе
                  потребовать от Покупателя компенсации фактических расходов
                  Продавца на комплектацию и разукомплектацию такого заказа.
               </li>
            </ul>
            <h2>7. Возврат товара и денежных средств</h2>
            <ul>
               <li>
                  7.1. Порядок и сроки возврата Товара надлежащего качества:
                  <p className="ml-2">
                     Покупатель вправе отказаться от Товара в любое время до его
                     передачи, а после передачи в соответствии законом РБ от 9
                     января 2002 г. № 90-З «О защите прав потребителей».
                  </p>
                  <p className="ml-2">
                     Возврат Товара надлежащего качества возможен в случае, если
                     сохранены его товарный вид, упаковка, потребительские
                     свойства, а также документ, подтверждающий факт и условия
                     покупки Товара.
                  </p>
                  <p className="ml-2">
                     Истечение срока годности Товара означает, что
                     потребительские свойства Товара не сохранены – возврат
                     такого Товара в порядке, установленном для возврата Товаров
                     надлежащего качества, не допускается.
                  </p>
                  <p className="ml-2">
                     При отказе Покупателя от Товара Владелец Сайта должен
                     возвратить ему сумму, уплаченную Покупателем, за
                     исключением расходов Владельца Сайта на доставку от
                     Покупателя возвращенного Товара, не позднее чем через 10
                     дней с даты предъявления Покупателем соответствующего
                     требования. С согласия Покупателя возвращенная денежная
                     сумма может быть зачислена на депозит Покупателя в личном
                     кабинете на Сайте и в дальнейшем может быть использована
                     для оплаты (частичной оплаты) Товара.
                  </p>
               </li>
               <li>
                  7.2. В случае если Покупателю передан Товар с нарушением
                  условий договора, касающихся количества, ассортимента,
                  качества, комплектности, тары и (или) упаковки товара,
                  Покупатель вправе в день передачи Товара известить Владельца
                  Сайта об этих нарушениях.
               </li>
               <li>
                  7.3. Под товаром ненадлежащего качества подразумевается товар
                  с нарушенной упаковкой, с истекшим сроком годности, а также
                  товар, который имеет характерный запах или вкус, позволяющие
                  характеризовать его как непригодный к употреблению.
                  <br />
                  Если Покупателю был передан товар ненадлежащего качества, и
                  это не было заранее оговорено продавцом, он вправе
                  воспользоваться положениями ст. 18 Закона о защите прав
                  потребителей. Покупатель вправе по своему выбору: потребовать
                  замены товара, отказаться от исполнения договора
                  купли-продажи, возвратить товар ненадлежащего качества и
                  потребовать возврата уплаченной за товар денежной суммы.
               </li>
               <li>
                  7.4. Требования в отношении недостатков Товара могут быть
                  предъявлены:
                  <br />в отношении продовольственных Товаров – в течение срока
                  годности; <br /> в отношении непродовольственных Товаров – в
                  течение гарантийного срока, установленного производителем.
               </li>
               <li>
                  7.5. Возврат Товара Покупателем может быть осуществлен по
                  адресу (месту нахождения) Владельца Сайта либо путем передачи
                  курьеру, передавшему Покупателю данный товар, с условием
                  оплаты услуги по вывозу Товара.
                  <p className="ml-2">
                     Для возврата товара, а также в случае предъявления
                     претензий к качеству товара Покупателю необходимо написать
                     на почту Владельца Сайта farm.basket.shop@gmail.com или
                     позвонить по телефону + 375333729057 с целью урегулирования
                     ситуации.
                  </p>
                  <p className="ml-2">
                     Для возврата Товара Покупателю необходимо обеспечить
                     сохранение товарного вида, потребительских свойств Товара
                     надлежащего качества до возврата его Продавцу или Владельцу
                     Сайта.
                  </p>
                  <p className="ml-2">
                     При возврате Товара сумма, уплаченная Покупателем за Товар,
                     возвращается Владельцем Сайта в течение 10 дней с момента
                     возврата Товара, путем перечисления денежных средств по
                     указанным Покупателем реквизитам, или тем способом, которым
                     Покупатель оплатил Заказ.
                  </p>
               </li>
            </ul>
            <h2>8. Ответственность</h2>
            <ul>
               <li>
                  8.1. В случае форс-мажорных обстоятельств, документально
                  подтвержденных соответствующими органами, стороны
                  освобождаются от исполнения настоящего договора.
               </li>
               <li>
                  8.2. Продавец и Владелец Сайта не несет ответственности, не
                  может выступать в качестве ответчика в суде и не возмещает
                  убытки, возникшие у Покупателя из-за действия или бездействия
                  третьих лиц.
               </li>
               <li>
                  8.3. Продавец и Владелец Сайта не несет ответственности за
                  неисполнение либо ненадлежащее исполнение своих обязательств
                  вследствие сбоев в телекоммуникационных и энергетических
                  сетях, действий вредоносных программ, а также недобросовестных
                  действий третьих лиц, направленных на несанкционированный
                  доступ и/или выведение из строя программного и/или аппаратного
                  комплекса сайта. Вместе с тем Продавец обязуется принимать все
                  разумные меры для предотвращения таких перебоев.
               </li>
               <li>
                  8.4. Продавец и Владелец Сайта не несет ответственности в
                  случае неправильного выбора Покупателем характеристик или
                  модификации товара, являющегося предметом договора
                  купли-продажи.
               </li>
               <li>
                  8.5. Продавец и Владелец Сайта не несет ответственности за
                  ущерб, причиненный Покупателю вследствие ненадлежащего
                  использования Товаров, приобретенных на Сайте.
               </li>
               <li>
                  8.6. Стороны прилагают максимальные усилия с целью устранения
                  возникающих разногласий путем переговоров. Срок ответа на
                  досудебную претензию составляет 15 календарных дней с момента
                  получения претензии. В случае недостижения согласия путем
                  переговоров спор подлежит разрешению в суде в соответствии с
                  действующим законодательством.
               </li>
               <li>
                  8.7. Сайт содержит материалы, охраняемые авторским правом,
                  товарные знаки и иные охраняемые законом материалы, включая,
                  но не ограничиваясь: тексты, фотографии, графические
                  изображения. Продавцу принадлежат исключительные права на
                  использование содержания сайта, кроме случаев, отдельно
                  отмеченных в содержании опубликованных на сайте материалов.
                  Покупатель, не имеет права вносить изменения, публиковать,
                  передавать третьим лицам, участвовать в продаже или уступке,
                  создавать производные продукты или иным образом использовать,
                  частично или полностью, содержание сайта.
               </li>
            </ul>
            <h2>9. Срок действия Оферты</h2>
            <ul>
               <li>
                  9.1. Настоящая Публичная оферта вступает в силу с момента ее
                  акцепта Посетителем Сайта/Покупателем, и действует до момента
                  отзыва акцепта Публичной оферты или до момента ее фактического
                  исполнения, в зависимости от того, что наступит раньше.
               </li>
            </ul>
            <h2>10. Дополнительные условия</h2>
            <ul>
               <li>
                  10.1. Продавец вправе переуступать либо каким-либо иным
                  способом передавать свои права и обязанности, вытекающие из
                  его отношений с Покупателем, третьим лицам.
               </li>
               <li>
                  10.2. Сайт и предоставляемые сервисы могут быть временно
                  частично или полностью недоступны по причине проведения
                  профилактических или иных работ или по любым другим причинам
                  технического характера.
                  <br />
                  Техническая служба Владельца Сайта периодически проводит
                  профилактические или иные работы на Сайте, которые могут
                  ограничивать работу Сайта в целом или частично, с
                  предварительным уведомлением Покупателей или без такового.
               </li>
               <li>
                  10.3. Признание судом недействительности какого-либо положения
                  Оферты не влечет за собой недействительность остальных
                  положений.
               </li>
            </ul>
            <div className="requisites">
               <p>
                  Платежные реквизиты: ИП Лещёва Злата Максимовна
                  <br />
                  УНП 291887836
                  <br />
                  BY65PJCB30136064381000000933
                  <br />
                  ‘ПРИОРБАНК’ ОАО, БИК PJCBBY2X
                  <br />
                  Телефон: +375 33 3729057
                  <br />
                  E-mail: farm.basket.shop@gmail.com
                  <br />
                  Сайт: <a href="https://farmbasket.by" className="text-blue-500 underline">FARM-BASKET.by</a>
               </p>
            </div>
         </div>
      </div>
   );
};

export default OfferPage;
