"use client";

const PrivacyPolicePage = () => {
   return (
      <div>
         <h1 className="legal-title">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ</h1>

         <div className="legal">
            <p>
               Настоящая Политика конфиденциальности персональных данных (далее
               – Политика конфиденциальности) действует в отношении всей
               информации, которую сайт{" "}
               <a href="https://farmbasket.by">FARM-BASKET.BY</a> может получить
               о Пользователе во время использования сайта.
            </p>
            <h2>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2>
            <p>
               1.1. В настоящей Политике конфиденциальности используются
               следующие термины:
            </p>
            <ul>
               <li>
                  1.1.1. «Сайт» – сайт{" "}
                  <a href="https://farmbasket.by">FARM-BASKET.BY</a>
               </li>
               <li>
                  1.1.2. «Администрация Сайта» – уполномоченные сотрудники по
                  управлению сайтом, которые организуют и (или) осуществляет
                  обработку персональных данных, а также определяет цели
                  обработки персональных данных, состав персональных данных,
                  подлежащих обработке, действия (операции), совершаемые с
                  персональными данными.
               </li>
               <li>
                  1.1.3. «Персональные данные» - любая информация, относящаяся к
                  прямо или косвенно определенному или определяемому физическому
                  лицу (субъекту персональных данных).{" "}
               </li>
               <li>
                  1.1.4. «Обработка персональных данных» - любое действие
                  (операция) или совокупность действий (операций), совершаемых с
                  использованием средств автоматизации или без использования
                  таких средств с персональными данными, включая сбор, запись,
                  систематизацию, накопление, хранение, уточнение (обновление,
                  изменение), извлечение, использование, передачу
                  (распространение, предоставление, доступ), обезличивание,
                  блокирование, удаление, уничтожение персональных данных.
               </li>
               <li>
                  1.1.5. «Конфиденциальность персональных данных» - обязательное
                  для соблюдения Администрацией Сайта или иным получившим доступ
                  к персональным данным лицом требование не допускать их
                  распространения без согласия субъекта персональных данных или
                  наличия иного законного основания.
               </li>
               <li>
                  1.1.6. «Пользователь Сайта (далее Пользователь)» – лицо,
                  имеющее доступ к Сайту, посредством сети Интернет и
                  использующее Сайт.
               </li>
               <li>
                  1.1.7. «Cookies» — небольшой фрагмент данных, отправленный
                  веб-сервером и хранимый на компьютере пользователя, который
                  веб-клиент или веб-браузер каждый раз пересылает веб-серверу в
                  HTTP-запросе при попытке открыть страницу соответствующего
                  сайта.
               </li>
               <li>
                  1.1.8. «IP-адрес» — уникальный сетевой адрес узла в
                  компьютерной сети, построенной по протоколу IP.
               </li>
            </ul>
            <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
            <ul>
               <li>
                  2.1. Использование Пользователем Сайта означает согласие с
                  настоящей Политикой конфиденциальности и условиями обработки
                  персональных данных Пользователя.
               </li>
               <li>
                  2.2. В случае несогласия с условиями Политики
                  конфиденциальности Пользователь должен прекратить
                  использование Сайта.
               </li>
               <li>
                  2.3. Настоящая Политика конфиденциальности применяется только
                  к Сайту. Сайт не контролирует и не несет ответственность за
                  сайты третьих лиц, на которые Пользователь может перейти по
                  ссылкам, доступным на Сайте.
               </li>
               <li>
                  2.4. Администрация Сайта не проверяет достоверность
                  персональных данных, предоставляемых Пользователем Сайта.
               </li>
            </ul>
            <h2>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h2>
            <p>
               3.1. Настоящая Политика конфиденциальности устанавливает
               обязательства Администрации Сайта по неразглашению и обеспечению
               режима защиты конфиденциальности персональных данных, которые
               Пользователь предоставляет по запросу Администрации Сайта при
               регистрации на Сайте или при совершении иных действий посредством
               Сайта.
            </p>
            <p>
               3.2. Персональные данные, разрешённые к обработке в рамках
               настоящей Политики конфиденциальности, предоставляются
               Пользователем путём заполнения формы, и могут включать в себя
               следующую информацию:
            </p>
            <ul>
               <li>3.2.1. фамилию, имя, отчество Пользователя;</li>
               <li>3.2.2. контактный телефон Пользователя;</li>
               <li>3.2.3. адрес электронной почты (e-mail);</li>
            </ul>
            <p>
               3.3. Сайт защищает данные, которые автоматически передаются при
               посещении страниц, на которых установлен статистический скрипт
               системы («пиксель»):
            </p>
            <ul>
               <li>IP адрес;</li>
               <li>информация из cookies;</li>
               <li>
                  информация о браузере (или иной программе, которая
                  осуществляет доступ к показу рекламы);
               </li>
               <li>время доступа;</li>
               <li>
                  адрес страницы, на которой расположен рекламный блок; реферер
                  (адрес предыдущей страницы);
               </li>
            </ul>
            <p>
               3.3.1. Отключение cookies может повлечь невозможность доступа к
               частям Сайта, требующим авторизации.
            </p>
            <p>
               3.3.2. Сайт осуществляет сбор статистики об IP-адресах своих
               посетителей. Данная информация используется с целью выявления и
               решения технических проблем, для контроля законности проводимых
               финансовых платежей.
            </p>
            <p>
               3.4. Любая иная персональная информация неоговоренная выше
               (история покупок, используемые браузеры и операционные системы и
               т.д.) подлежит надежному хранению и нераспространению, за
               исключением случаев, предусмотренных в п.п. 5.2. и 5.3. настоящей
               Политики конфиденциальности.
            </p>
            <h2>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ ПОЛЬЗОВАТЕЛЯ</h2>
            <p>
               4.1. Персональные данные Пользователя Администрация Сайта может
               использовать в целях:
            </p>
            <ul>
               <li>
                  4.1.1. Установления с Пользователем обратной связи, включая
                  направление уведомлений, запросов, касающихся использования
                  Сайта, оказания услуг, обработка запросов и заявок от
                  Пользователя.
               </li>
               <li>
                  4.1.2. Определения места нахождения Пользователя для
                  обеспечения безопасности, предотвращения мошенничества.
               </li>
               <li>
                  4.1.3. Подтверждения достоверности и полноты персональных
                  данных, предоставленных Пользователем.
               </li>
               <li>
                  4.1.3. Подтверждения достоверности и полноты персональных
                  данных, предоставленных Пользователем.
               </li>
               <li>
                  4.1.5. Предоставления Пользователю с его согласия, новостной
                  рассылки и иных сведений от имени Сайта.
               </li>
               <li>
                  4.1.6. Осуществления рекламной деятельности с согласия
                  Пользователя.
               </li>
               <li>
                  4.1.7. Предоставления доступа Пользователю на сайты или
                  сервисы партнеров Сайта с целью получения продуктов,
                  обновлений и услуг.
               </li>
            </ul>
            <h2>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2>
            <p>
               5.1. Обработка персональных данных Пользователя осуществляется
               без ограничения срока, любым законным способом, в том числе в
               информационных системах персональных данных с использованием
               средств автоматизации или без использования таких средств.
            </p>
            <p>
               5.2. Пользователь соглашается с тем, что Администрация Сайта
               вправе передавать персональные данные третьим лицам, в частности,
               курьерским службам, организациями почтовой связи, операторам
               электросвязи, исключительно в целях выполнения заказа
               Пользователя, оформленного на Сайте.
            </p>
            <p>
               5.3. Персональные данные Пользователя могут быть переданы
               уполномоченным органам государственной власти Республики Беларусь
               только по основаниям и в порядке, установленным законодательством
               Республики Беларусь.
            </p>
            <p>
               5.4. При утрате или разглашении персональных данных Администрация
               сайта информирует Пользователя об утрате или разглашении
               персональных данных.
            </p>
            <p>
               5.5. Администрация сайта принимает необходимые организационные и
               технические меры для защиты персональной информации Пользователя
               от неправомерного или случайного доступа, уничтожения, изменения,
               блокирования, копирования, распространения, а также от иных
               неправомерных действий третьих лиц.
            </p>
            <p>
               5.6. Администрация сайта совместно с Пользователем принимает все
               необходимые меры по предотвращению убытков или иных отрицательных
               последствий, вызванных утратой или разглашением персональных
               данных Пользователя.
            </p>
            <h2>6. ОБЯЗАТЕЛЬСТВА СТОРОН</h2>
            <p>6.1. Пользователь обязан:</p>
            <ul>
               <li>
                  6.1.1. Предоставить информацию о персональных данных,
                  необходимую для пользования Сайтом.
               </li>
               <li>
                  6.1.2. Обновить, дополнить предоставленную информацию о
                  персональных данных в случае изменения данной информации.
               </li>
            </ul>
            <p>6.2. Администрация сайта обязана:</p>
            <ul>
               <li>
                  6.2.1. Использовать полученную информацию исключительно для
                  целей, указанных в п. 4 настоящей Политики конфиденциальности.
               </li>
               <li>
                  6.2.2. Обеспечить хранение конфиденциальной информации в
                  тайне, не разглашать без предварительного письменного
                  разрешения Пользователя, а также не осуществлять продажу,
                  обмен, опубликование, либо разглашение иными возможными
                  способами переданных персональных данных Пользователя, за
                  исключением п.п. 5.2. и 5.3. настоящей Политики
                  Конфиденциальности.
               </li>
               <li>
                  6.2.3. Принимать меры предосторожности для защиты
                  конфиденциальности персональных данных Пользователя согласно
                  порядку, обычно используемого для защиты такого рода
                  информации в существующем деловом обороте.
               </li>
               <li>
                  6.2.4. Осуществить блокирование персональных данных,
                  относящихся к соответствующему Пользователю, с момента
                  обращения или запроса Пользователя или его законного
                  представителя либо уполномоченного органа по защите прав
                  субъектов персональных данных на период проверки, в случае
                  выявления недостоверных персональных данных или неправомерных
                  действий.
               </li>
            </ul>
            <h2>7. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
            <p>
               7.1. Администрация Сайта, не исполнившая свои обязательства,
               несёт ответственность за убытки, понесённые Пользователем в связи
               с неправомерным использованием персональных данных, в
               соответствии с законодательством Республики Беларусь, за
               исключением случаев, предусмотренных п.п. 5.2., 5.3. и 7.2.
               настоящей Политики Конфиденциальности.
            </p>
            <p>
               7.2. В случае утраты или разглашения Конфиденциальной информации
               Администрация Сайта не несёт ответственность, если данная
               конфиденциальная информация:
            </p>
            <ul>
               <li>
                  7.2.1. Стала публичным достоянием до её утраты или
                  разглашения.
               </li>
               <li>
                  7.2.2. Была получена от третьей стороны до момента её
                  получения Администрацией Сайта.
               </li>
               <li>7.2.3. Была разглашена с согласия Пользователя.</li>
            </ul>
            <h2>8. РАЗРЕШЕНИЕ СПОРОВ</h2>
            <p>
               8.1. До обращения в суд с иском по спорам, возникающим из
               отношений между Пользователем Сайта и Администрацией Сайта,
               обязательным является предъявление претензии (письменного
               предложения о добровольном урегулировании спора).
            </p>
            <p>
               8.2. Получатель претензии в течение 30 (тридцати) календарных
               дней со дня получения претензии, письменно уведомляет заявителя
               претензии о результатах рассмотрения претензии
            </p>
            <p>
               8.3. При не достижении соглашения спор будет передан на
               рассмотрение в судебный орган в соответствии с действующим
               законодательством Республики Беларусь.
            </p>
            <p>
               8.4. К настоящей Политике конфиденциальности и отношениям между
               Пользователем и Администрацией Сайта применяется действующее
               законодательство Республики Беларусь.
            </p>
            <h2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
            <p>
               9.1. Администрация Сайта вправе вносить изменения в настоящую
               Политику конфиденциальности без согласия Пользователя.
            </p>
            <p>
               9.2. Новая Политика конфиденциальности вступает в силу с момента
               ее размещения на Сайте, если иное не предусмотрено новой
               редакцией Политики конфиденциальности.
            </p>
         </div>
      </div>
   );
};

export default PrivacyPolicePage;
