"use client";
import Title from "@/components/ui/Title";
import React from "react";

const PrivacyPolicePage = () => {
   return (
      <div>
         <Title title="ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ" />

         <div className="privacy-policy">
            <h1>Политика конфиденциальности персональных данных</h1>
            <p>
               Настоящая Политика конфиденциальности персональных данных (далее
               – Политика конфиденциальности) действует в отношении всей
               информации, которую сайт <strong>FARM-BASKET.BY</strong> может
               получить о Пользователе во время использования сайта.
            </p>

            <h2>1. ОПРЕДЕЛЕНИЕ ТЕРМИНОВ</h2>
            <ol>
               <li>
                  «Сайт» – сайт <strong>FARM-BASKET.BY</strong>
               </li>
               <li>
                  «Администрация Сайта» – уполномоченные сотрудники по
                  управлению сайтом...
               </li>
               <li>
                  «Персональные данные» – любая информация, относящаяся к прямо
                  или косвенно определенному лицу...
               </li>
               <li>
                  «Обработка персональных данных» – любое действие (операция)...
               </li>
               <li>
                  «Конфиденциальность персональных данных» – обязательное
                  требование не допускать их распространения...
               </li>
               <li>«Пользователь Сайта» – лицо, имеющее доступ к Сайту...</li>
               <li>
                  «Cookies» — небольшой фрагмент данных, отправленный
                  веб-сервером...
               </li>
               <li>
                  «IP-адрес» — уникальный сетевой адрес узла в компьютерной
                  сети...
               </li>
            </ol>

            <h2>2. ОБЩИЕ ПОЛОЖЕНИЯ</h2>
            <ol>
               <li>
                  Использование Пользователем Сайта означает согласие с
                  настоящей Политикой...
               </li>
               <li>
                  В случае несогласия Пользователь должен прекратить
                  использование Сайта.
               </li>
               <li>
                  Политика применяется только к Сайту. Администрация не несет
                  ответственность за сторонние сайты...
               </li>
               <li>
                  Администрация не проверяет достоверность персональных
                  данных...
               </li>
            </ol>

            <h2>3. ПРЕДМЕТ ПОЛИТИКИ КОНФИДЕНЦИАЛЬНОСТИ</h2>
            <p>
               Настоящая Политика устанавливает обязательства Администрации по
               неразглашению и обеспечению защиты персональных данных...
            </p>
            <ul>
               <li>фамилия, имя, отчество Пользователя;</li>
               <li>контактный телефон;</li>
               <li>адрес электронной почты (e-mail).</li>
            </ul>
            <p>Сайт также может собирать данные:</p>
            <ul>
               <li>IP-адрес;</li>
               <li>информация из cookies;</li>
               <li>данные о браузере и времени доступа;</li>
               <li>адрес страницы, реферер.</li>
            </ul>

            <h2>4. ЦЕЛИ СБОРА ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ</h2>
            <ol>
               <li>Обратная связь с Пользователем...</li>
               <li>
                  Определение места нахождения для обеспечения безопасности...
               </li>
               <li>Подтверждение достоверности данных...</li>
               <li>Предоставление технической поддержки...</li>
               <li>Отправка новостных рассылок при согласии Пользователя...</li>
               <li>Рекламная деятельность с согласия Пользователя...</li>
               <li>Предоставление доступа к сервисам партнеров...</li>
            </ol>

            <h2>5. СПОСОБЫ И СРОКИ ОБРАБОТКИ</h2>
            <p>
               Обработка персональных данных осуществляется без ограничения
               срока, любым законным способом...
            </p>

            <h2>6. ОБЯЗАТЕЛЬСТВА СТОРОН</h2>
            <p>
               <strong>Пользователь обязан:</strong>
            </p>
            <ul>
               <li>
                  Предоставить необходимую информацию для пользования Сайтом;
               </li>
               <li>Обновлять персональные данные при их изменении.</li>
            </ul>
            <p>
               <strong>Администрация обязана:</strong>
            </p>
            <ul>
               <li>
                  Использовать полученные данные исключительно для целей,
                  указанных в Политике;
               </li>
               <li>Обеспечить хранение и конфиденциальность;</li>
               <li>Принимать меры предосторожности для защиты данных;</li>
               <li>Блокировать персональные данные при выявлении нарушений.</li>
            </ul>

            <h2>7. ОТВЕТСТВЕННОСТЬ СТОРОН</h2>
            <p>
               Администрация несёт ответственность за убытки Пользователя в
               случае неправомерного использования данных...
            </p>

            <h2>8. РАЗРЕШЕНИЕ СПОРОВ</h2>
            <p>
               До обращения в суд обязательным является предъявление претензии.
               Срок ответа — 30 календарных дней...
            </p>

            <h2>9. ДОПОЛНИТЕЛЬНЫЕ УСЛОВИЯ</h2>
            <p>
               Администрация вправе изменять Политику без согласия Пользователя.
               Новая редакция вступает в силу с момента публикации.
            </p>
         </div>
      </div>
   );
};

export default PrivacyPolicePage;
