export const Questions = [
   {
      title: "ПОЧЕМУ ФЕРМЕРСКИЕ ПРОДУКТЫ ДОРОЖЕ?",
      description: `Фермерские продукты обычно дороже по нескольким причинам, связанным с методами производства, масштабами и условиями труда. Вот основные факторы:
   
   <ul class="list-decimal pl-5">
     <li>Экологические стандарты</li>
     <li>Ручной труд</li>
     <li>Транспорт и логистика</li>
     <li>Сезонность и зависимость от природных условий</li>
     <li>Качество и свежесть</li>
     <li>Сертификация</li>
   </ul> `,
   },
   {
      title: "КАК МОЖНО ОПЛАТИТЬ ЗАКАЗ?",
      description: `Сервис FARM-BASKET предоставляет несколько вариантов оплаты, и Вы можете выбрать любой удобный. Вы можете привязать банковскую карту в личном кабинете и оплачивать онлайн либо производить наличную или безналичную оплату курьеру при получении заказа. `,
   },
   {
      title: "МОЖНО ЛИ УЗНАТЬ ИНФОРМАЦИЮ О ПРОИЗВОДИТЕЛЯХ?",
      description: `Мы заботимся о доверии к продукции наших фермеров и стараемся предоставлять наиболее полную информацию о них. Сведения о каждом производителе Вы можете узнать в разделе “Производители” перейдя в личный кабинет фермера.`,
   },
];
